{"body":"<h4 id=\"-closed-control-state-\">(Closed Control State)</h4>\n<ul>\n<li><strong>open the dropdown</strong></li>\n</ul>\n<p>Pressing enter when the the control has focus will open the dropdown.</p>\n<h4 id=\"-closed-control-state-when-tag-removal-button-focused-\">(Closed Control State - when tag removal button focused)</h4>\n<ul>\n<li><strong>remove the focused tag</strong> (only applicable to controls with the <strong>tags</strong> property set to true) </li>\n</ul>\n<p>Pressing enter when a tag removal button has focus will remove the tag from the selected values.  After the tag has been removed, focus is moved to the first-available tag removal button.</p>\n<h4 id=\"-opened-control-state-\">(Opened Control State)</h4>\n<ul>\n<li><strong>Select the currently focused option</strong></li>\n</ul>\n<p>Pressing the enter key selects the option that currently has focus.  In a non-multiselect control, the dropdown will close after the selection is made.</p>\n<h4 id=\"multiselect-specific-behaviors\">Multiselect Specific Behaviors</h4>\n<h4 id=\"-with-ctrl-key-or-meta-key-held-down-\">(With ctrl-key or meta-key held down)</h4>\n<ul>\n<li><strong>toggle selection state of the currently focused option</strong></li>\n</ul>\n<p>When the enter key is pressed along with the ctrl-key or meta-key. The currently focused option will be selected, or deselected if it was already selected when clicked</p>\n<h4 id=\"-with-shift-key-held-down-\">(With shift-key held down)</h4>\n<ul>\n<li><strong>select a range of options from last selected to currently focused option</strong></li>\n</ul>\n<p>When the enter key is pressed along with the shift-key while a option has focus, All values in the range from the last selected option to the currently focused option will be selected.  </p>\n<p>If no option was previously selected, all options from the first option to the focused option will be selected.</p>\n<ul>\n<li><strong>deselect a range up to but not including the focused option</strong></li>\n</ul>\n<p>If the focused option has already been selected when the user clicks enter along with the shift-key, any selected options in the range between the last selected option and the focused option will be deselected.  The focused option will remain selected in this case.</p>\n","updatedAt":"2015-09-09T04:33:41.000Z"}